backend/auth/auth-api/src/test/resources/billing/invoice/invoicePaid.json

{
  "id": "evt_1HS6JDI1ysvdCIIxLO69z4e7",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1600284531,
  "data": {
    "object": {
      "id": "in_1HS6JBI1ysvdCIIxTy8CIG2f",
      "object": "invoice",
      "account_country": "SI",
      "account_name": null,
      "amount_due": 1500,
      "amount_paid": 1500,
      "amount_remaining": 0,
      "application_fee_amount": null,
      "attempt_count": 1,
      "attempted": true,
      "auto_advance": false,
      "billing_reason": "subscription_create",
      "charge": "ch_1HS6JCI1ysvdCIIxj9IRYnqJ",
      "collection_method": "charge_automatically",
      "created": 1600284529,
      "currency": "usd",
      "custom_fields": null,
      "customer": "cus_I2AefE3tst38dc",
      "customer_address": null,
      "customer_email": "ematej.snuderl@gmail.com",
      "customer_name": null,
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discount": null,
      "discounts": [],
      "due_date": null,
      "ending_balance": 0,
      "footer": null,
      "hosted_invoice_url": "https://pay.stripe.com/invoice/acct_1HRYgqI1ysvdCIIx/invst_I2AeqADk2KMbDPgEXpvCrPN18Sb0zLk",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1HRYgqI1ysvdCIIx/invst_I2AeqADk2KMbDPgEXpvCrPN18Sb0zLk/pdf",
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_1HS6JBI1ysvdCIIxMh4FhO3H",
            "object": "line_item",
            "amount": 1500,
            "currency": "usd",
            "description": "1 × Billing Guide: Premium Service (at $15.00 / month)",
            "discount_amounts": [],
            "discountable": true,
            "discounts": [],
            "livemode": false,
            "metadata": {},
            "period": {
              "end": 1602876529,
              "start": 1600284529
            },
            "plan": {
              "id": "price_1HRjvtI1ysvdCIIxwuxy4FEI",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 1500,
              "amount_decimal": "1500",
              "billing_scheme": "per_unit",
              "created": 1600198517,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "product": "prod_I1bvMWginyIvlU",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1HRjvtI1ysvdCIIxwuxy4FEI",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1600198517,
              "currency": "usd",
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "product": "prod_I1bvMWginyIvlU",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 1500,
              "unit_amount_decimal": "1500"
            },
            "proration": false,
            "quantity": 1,
            "subscription": "sub_I2AeeKMFULwZLf",
            "subscription_item": "si_I2AeWYZRGB0LUO",
            "tax_amounts": [],
            "tax_rates": [],
            "type": "subscription"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_1HS6JBI1ysvdCIIxTy8CIG2f/lines"
      },
      "livemode": false,
      "metadata": {},
      "next_payment_attempt": null,
      "number": "6ED8CCF9-0009",
      "paid": true,
      "payment_intent": "pi_1HS6JBI1ysvdCIIxR9amn4uc",
      "period_end": 1600284529,
      "period_start": 1600284529,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "receipt_number": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "paid",
      "status_transitions": {
        "finalized_at": 1600284529,
        "marked_uncollectible_at": null,
        "paid_at": 1600284529,
        "voided_at": null
      },
      "subscription": "sub_I2AeeKMFULwZLf",
      "subtotal": 1500,
      "tax": null,
      "total": 1500,
      "total_discount_amounts": [],
      "total_tax_amounts": [],
      "transfer_data": null,
      "webhooks_delivered_at": null
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_7SK6ZwMqX6uuCW",
    "idempotency_key": "7500f7ca-02f1-4dd6-bb04-14b8f0affb9f"
  },
  "type": "invoice.paid"
}
